<section class="news">
    <div class="container">
        <div class="news__content-inner">
            <h3 class="profile__title">
                Новости
            </h3>
            <div class="news-list">
                <div class="news-list__item">
                    <h4>Разбор технодемки «Матрицы» с TGA.</h4>
                    <p>Среди многочисленных анонсов на The Game Awards 2021 (вот тут все-все-все самое главное) выделялся один проект, представить который пришли лично Киану Ривз (Keanu Reeves) и Кэрри-Энн Мосс (Carrie-Anne Moss), — The Matrix Awakens: An Unreal Engine 5 Experience («Пробуждение Матрицы: опыт Unreal Engine 5»). Что это такое — сейчас разберемся.
                        <iframe width="655" height="368" src="https://www.youtube.com/embed/RkA5CjdkM8M" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
                        Перед нами не полноценная игра, а лишь техническое демо, созданное на движке Unreal Engine 5. Очевидно, что проект — лишь часть рекламной кампании грядущего киноблокбастера «Матрица: Воскрешение». Но интересно здесь то, что в создании принимали участие лично Лана Вачовски (Lana Wachowski) и другие соавторы оригинального фильма. Это значит, что «Пробуждение Матрицы» нечто большее, чем просто крутая реклама.
                        <br>
                        Всего доступно два раздела: погоня и свободное изучение города. Оба они показывают возможности UE5. Однако если город — это скорее большая декорация с минимальным количеством интерактива, то погоня уже гораздо интереснее.
                        <br>
                        В начале мы видим постаревшего Нео, который тут же становится Киану Ривзом, а затем перевоплощается в Кэрри-Энн Мосс. Герои общаются напрямую с игроком и задают вечные вопросы, которые не раз поднимались в фильмах: что если всё вокруг иллюзия; есть ли разница между реальностью и вымыслом, если все выглядит одинаково? Ривз рассказывает, как снимался в первой «Матрице», которая во многом изменила современный кинематограф, однако это была лишь первая ступень. Спустя 20 лет мир, в котором можно мгновенно менять свою внешность, одежду и окружающую обстановку, уже не кажется такой далекой фантастикой.
                        <br>
                        Неожиданно философский разговор сменяется на яростную погоню. Нео и Тринити пытаются сбежать от команды маркетологов, которые, по словам героя, страшнее самих агентов. Однако в машине есть и третий персонаж — молодая девушка. И здесь начинается самое интересное. Девушка похожа на сильно омоложенную версию Ниобе — возлюбленную Морфеуса. Однако в матрице героиня ведет себя неуверенно, будто попала туда впервые.
                        <br>
                        Нео улетает в неизвестном направлении, а Тринити и игрок в роли новенькой остаются отбиваться от маркетологов. Красивейшая погоня заканчивается взрывом целой трассы, после чего сюжетная часть заканчивается.
                        <img src="https://vgtimes.ru/uploads/posts/2021-12/thumbs/1639157051_the-matrix-awakens_-an-unreal-engine-5-experience_20211210121405.jpg" alt="">
                        Второй раздел демо переносит нас в город, где мы, управляя всё той же незнакомкой, можем свободно перемещаться, кататься на машине и читать полезную информацию о возможностях движка. Также доступен полет над небоскребами от первого лица. Так проще оценить дальность прорисовки, изменить время суток и понаблюдать за множеством разных эффектов. Путешествие по мегаполису не ограничено по времени, однако никакого дополнительного контента больше не будет.
                    </p>
                </div>
                <div class="news-list__item">
                    <h4>На что способен движок Unreal Engine 5</h4>
                    <p>Возможности Unreal Engine 5 завораживают. Крупные планы с Киану Ривзом, когда из живого актера он плавно становится персонажем и обратно, — абсолютный восторг. На закате предыдущего поколения консолей многим казалось, что пределы графики достигнуты. Новый движок показывает, что это не так. Каждый волос на теле, отражение или выстрел — фотореалистичны. Врезаясь на машине, вы не увидите двух одинаковых аварий — повреждения всегда разные. Потоки автомобилей и толпы людей также приятно удивляют — подобного все ждали от Cyberpunk 2077. Невольно представляешь, как в таких условиях выглядел бы новый проект про Человека-паука.
                        <img src="https://vgtimes.ru/uploads/posts/2021-12/thumbs/1639157054_the-matrix-awakens_-an-unreal-engine-5-experience_20211210121727.jpg" alt="">
                        Возможности Unreal Engine 5 завораживают. Крупные планы с Киану Ривзом, когда из живого актера он плавно становится персонажем и обратно, — абсолютный восторг. На закате предыдущего поколения консолей многим казалось, что пределы графики достигнуты. Новый движок показывает, что это не так. Каждый волос на теле, отражение или выстрел — фотореалистичны. Врезаясь на машине, вы не увидите двух одинаковых аварий — повреждения всегда разные. Потоки автомобилей и толпы людей также приятно удивляют — подобного все ждали от Cyberpunk 2077. Невольно представляешь, как в таких условиях выглядел бы новый проект про Человека-паука.
                        <br>
                        Правда, даже на PS5 демо периодически лагает, и это при 30 кадрах в секунду. Сейчас подобный уровень графики возможен только в демонстрациях, поэтому в ближайшее время мы едва ли увидим открытый мир с такой детализацией. Похожие эмоции вызывал когда-то первый ролик Watch Dogs. Однако сюжетные игры с замкнутыми уровнями вполне могут показать нам нечто подобное уже совсем скоро.
                    </p>
                </div>
                <div class="news-list__item">
                    <h4>Обзор Halo Infinite. Прекрасный западный консольный шутер с отличным ганплеем на замену православных Call of Duty, Half-Life и Battlefield </h4>
                    <p>
                        Уже 8 декабря все обладатели подписки Game Pass смогут прокатиться на вездеходе «Вепрь» по дорогам Ореола Зета в роли легендарного Мастера Чифа, спасителя человечества. Рассказываем о непростом пути 343 Industries к релизу, откуда растут ноги самых спорных аспектов Halo Infinite и почему поклонникам шутеров стоит обратить внимание на этот западный культурный феномен. Даже если прежде вы предпочитали Call of Duty, Half-Life и Battlefield.
                        <img src="https://vgtimes.ru/uploads/posts/2021-12/thumbs/1638766766_tahoma-2021-12-02-09-14-02.jpg" alt="">
                        На самом деле всё, что вам нужно знать о Halo Infinite, уже было рассказано в материале с первыми впечатления. Это хороший консольный шутер, который теперь может попробовать каждый благодаря Game Pass. В нём есть умные враги, крутые боссы, классный арсенал пушек, в меру просторный открытый мир, на который можно забить (!) и бежать строго по сюжету (есть даже достижение за прохождение за 8 часов).
                        <br>
                        Однако чтобы лучше понять проблемы Halo Infinite, а заодно оценить невероятную работу, которую проделала 343 Industries за последний год, нужно обратиться к новостям вокруг создания проекта.
                        <img src="https://vgtimes.ru/uploads/posts/2021-12/thumbs/1638766645_tahoma-2021-12-02-02-39-16.jpg" alt="">
                        Переместимся в 2015 год. Выходит Halo 5: Guardians. Мультиплеер игры критикуют за лутбоксы в виде паков карточек с косметикой и не только, а также малое количество карт, заигрывание с аудиторией Call of Duty и отсутствие редактора уровней.
                        <br>
                        Кампанию же громят за потерянный в ярких искрах арт-стиль Halo, отсутствие диванного Split Screen для кооператива, постоянное использование одного и того же босса, малое количество Мастера Чифа, странные суперудары нового поколения спартанцев, ужасный ИИ напарников и, самое важное, ложную рекламу.
                        <img src="https://vgtimes.ru/uploads/posts/2021-12/thumbs/1638766670_tahoma-2021-12-02-00-49-19.jpg" alt="">
                        Напомним, что маркетинговый отдел подавал Halo 5: Guardians, как эпическое противостояние двух спартанцев, в котором Мастер Чиф, спаситель человечества, внезапно становится эдаким ренегатом-антигероем со своей правдой. А в итоге противостояние спартанца Лока и Чифа закончилось кулачной потасовкой в катсцене без вмешательства игрока. И потом все подружились против настоящего злодея пятой части.
                        <br>
                        Да, после этого 343 Industries нужно было что-то менять. И буквально сразу, в 2015 году, началась работа над шестой частью, а точнее новым движком Slipspace, демонстрацию возможностей которого мы впервые увидели в 2018-м. Кстати, в описании до сих пор есть строчка Xbox One and Windows 10 Exclusive. Но, как оказалось, игре было не суждено выйти только на Xbox One.
                        <br>
                        <iframe width="655" height="368" src="https://www.youtube.com/embed/Fmdb-KmlzD8" title="YouTube video player" frameborder="0" allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture" allowfullscreen></iframe>
                        В 2017 году начали появляться разговоры о том, что цикл разработки новой части может затянуться. Также можно найти упоминания о возвращении диванного кооператива, фокусе сюжета на Мастере Чифе и попытке мягко перезапустить всю серию. Но вместе с тем была и информация о планах сделать свой лайв-сервис наподобие Destiny.
                        <br>
                        2018-ый отличился тем, что команде в срочном порядке пришлось пресечь слухи о появлении в Halo Infinite аналога королевской битвы. И это был не первый и не последний раз, когда слухи вносили сумятицу.
                        <br>
                        В 2019-м до игроков начали доносить мысль, что игра будет практически духовным перезапуском Halo: Combat Evolved. Появился и первый сюжетный трейлер на движке Slipspace, в котором отчаявшийся пилот Echo 216 возвращает Мастера Чифа к жизни. И вроде всё хорошо, но в этот же год начинается утечка кадров с ключевых позиций.
                        <br>
                        В августе студию покидает творческий директор Тим Лонго (Tim Longo), но PR уверяет, что здесь нет ничего страшного и на помощь спешит ведущий продюсер Мэри Олсон (Mary Olson). Но уже в октябре и Мэри покидает 343 Industries. А уже летом 2020 года случился первый показ геймплея Halo Infinite. И эта была катастрофа.
                        <br>
                        Игра выглядело просто... никак. Низкая детализация, бедные текстуры и освещение. Мастер Чиф походил на зеленую пластиковую фигурку. Оружие в его руках выглядело хуже, чем в Halo: Reach (2010). А одного из брутов с грустным лицом игровое комьюнити нарекло Крейгом, раскатав на мемы. Первое впечатление спустя долгие пять лет ожиданий было подпорчено. И всё это происходило, когда мир уже чувствовал на себе последствия COVID-19, вынудевшего компании полностью пересматривать работу команд, раскидав всех на удаленку.
                        <img src="https://vgtimes.ru/uploads/posts/2021-12/thumbs/1638766889_tahoma-2021-12-02-18-41-48.jpg" alt="">
                        Именно лето 2020-го стало переломным для Halo Infinite. Прислушавшись к реакции игроков, 343 Industries перенесла дату выхода проекта. Новое поколение консолей Series S/X осталось без игры, которая должна была стать стартовым эксклюзивом. Затем произошло разделение кампании и мультиплеера, с переходом последнего на условно-бесплатную модель. С должности геймдиректора уходит Крис Ли (Chris Lee), в игровые СМИ снова пролезают слухи о режиме королевской битвы в Halo, а студия уже точно нацелена на релиз осенью 2021-го, но в итоге дата смещается на декабрь.
                        <img src="https://vgtimes.ru/uploads/posts/2021-12/thumbs/1638766820_tahoma-2021-12-02-12-09-25.jpg" alt="">
                        Единственная обнадеживающая новость того времени — это возвращение Джозефа Статена (Joseph Staten), работавшего над сценарием и поставкой в трилогии Halo авторства Bungie. Возможно, что для Halo Infinite его возвращение стало чем-то вроде появления Гэндальфа под конец битвы при Хельмовой Пади, переломившее ход сражения.
                        <br>
                        После всего этого производственного ада мы могли бы получить ещё один Crackdown 3 — игру, которую не смогли спасти ни растянувшиеся сроки разработки, ни надежный спонсор в лице Microsoft.
                        <img src="https://vgtimes.ru/uploads/posts/2021-12/thumbs/1638766683_tahoma-2021-12-02-08-58-41.jpg" alt="">
                        Но 343 Industries удалось сделать невероятное. Перешагнуть сыплющиеся кризисные ситуации, принять на себя критику игроков и журналистов, пожертвовав временем и деньгами, чтобы довести Halo Infinite до действительно готового состояния — пусть и с парой компромиссов. Например, очень жалко, что в Halo Infinite нельзя поиграть со старта в кооперативе, хотя это одна из особенностей серии.
                    </p>
                </div>
            </div>
        </div>
    </div>
</section>
